<h1 align=center><font size = 5, color=sky-blue>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
# !pip install update sqlalchemy==2.0
# from sqlalchemy import create_engine

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
# !pip install sql
# !pip install sql prettytable

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
%sql sqlite:///my_data1.db

MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [6]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String

# Create engine
engine = create_engine("sqlite:///my_data1.db", echo=True, future=True)

# Create metadata (no bind)
metadata = MetaData()

In [7]:
import pandas as pd
df = pd.read_csv("../Datasets/Spacex.csv")
df.to_sql("SPACEXTBL", con=engine, if_exists='replace', index=False,method="multi")

2025-09-02 22:41:11,293 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-09-02 22:41:11,298 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("SPACEXTBL")
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("SPACEXTBL")
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,300 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("SPACEXTBL")
2025-09-02 22:41:11,316 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,318 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-09-02 22:41:11,319 INFO sqlalchemy.engine.Engine [raw sql] ('SPACEXTBL',)
2025-09-02 22:41:11,322 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("SPACEXTBL")
2025-09-02 22:41:11,323 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,324 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("SPACEXTBL")
2025-09-02 22:41:11,325 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,328 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-09-02 22:41:11,329 INFO sqlalchemy.engine.Engine [raw sql] ('SPACEXTBL',)
2025-09-02 22:41:11,334 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("SPACEXTBL")
2025-09-02 22:41:11,335 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,337 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("SPACEXTBL")
2025-09-02 22:41:11,338 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,340 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("SPACEXTBL")
2025-09-02 22:41:11,341 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,342 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("SPACEXTBL")
2025-09-02 22:41:11,344 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,346 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("SPACEXTBL")
2025-09-02 22:41:11,347 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,348 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("SPACEXTBL")
2025-09-02 22:41:11,350 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,353 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-09-02 22:41:11,354 INFO sqlalchemy.engine.Engine [raw sql] ('SPACEXTBL',)
2025-09-02 22:41:11,359 INFO sqlalchemy.engine.Engine
DROP TABLE "SPACEXTBL"
2025-09-02 22:41:11,359 INFO sqlalchemy.engine.Engine [no key 0.00088s] ()
2025-09-02 22:41:11,367 INFO sqlalchemy.engine.Engine
CREATE TABLE "SPACEXTBL" (
	"Date" TEXT,
	"Time (UTC)" TEXT,
	"Booster_Version" TEXT,
	"Launch_Site" TEXT,
	"Payload" TEXT,
	"PAYLOAD_MASS__KG_" BIGINT,
	"Orbit" TEXT,
	"Customer" TEXT,
	"Mission_Outcome" TEXT,
	"Landing_Outcome" TEXT
)


2025-09-02 22:41:11,369 INFO sqlalchemy.engine.Engine [no key 0.00152s] ()
2025-09-02 22:41:11,406 INFO sqlalchemy.engine.Engine INSERT INTO "SPACEXTBL" ("Date", "Time (UTC)", "Booster_Version", "Launch_Site", "Payload", "PAYLOAD_MASS__KG_", "Orbit", "Customer", "Mission_Outcome", "Landing_Outcome") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?), (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2025-09-02 22:41:11,407 INFO sqlalchemy.engine.Engine [no key 0.00324s] ('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)', '2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)', '2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt', '2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt', '2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt' ... 910 parameters truncated ... '2020-11-05', '23:24:23', 'F9 B5B1062.1', 'CCAFS SLC-40', 'GPS III-04 , Crew-1', 4311, 'MEO', 'USSF', 'Success', 'Success', '2020-11-16', '0:27:00', 'F9 B5B1061.1 ', 'KSC LC-39A', 'Crew-1, Sentinel-6 Michael Freilich ', 12500, 'LEO (ISS)', 'NASA (CCP)', 'Success', 'Success', '2020-11-21', '17:17:08', 'F9 B5B1063.1', 'VAFB SLC-4E', 'Sentinel-6 Michael Freilich, Starlink 15 v1.0 ', 1192, 'LEO', 'NASA / NOAA / ESA / EUMETSAT', 'Success', 'Success', '2020-11-25', '2:13:00', 'F9 B5 B1049.7 ', 'CCAFS SLC-40', 'Starlink 15 v1.0, SpaceX CRS-21', 15600, 'LEO', 'SpaceX', 'Success', 'Success', '2020-12-06', '16:17:08', 'F9 B5 B1058.4 ', 'KSC LC-39A', 'SpaceX CRS-21', 2972, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Success')
2025-09-02 22:41:11,411 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-09-02 22:41:11,412 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-09-02 22:41:11,415 INFO sqlalchemy.engine.Engine COMMIT

101

**Note:This below code is added to remove blank rows from table**

#DROP THE TABLE IF EXISTS

`%sql DROP TABLE IF EXISTS SPACEXTABLE;`

1Ô∏è‚É£ What changed in SQLAlchemy 2.x

- Older %sql used the bind argument inside MetaData() to automatically know which database to run commands on.

- SQLAlchemy 2.x removed bind, because they want explicit connections and engines for safety, clarity, and better transaction management.

- %sql hasn‚Äôt fully updated yet for 2.x ‚Äî so it may throw the MetaData.__init__() got unexpected keyword argument 'bind' error.

# Quick compromise

If you still want easy SQL-like commands in Jupyter, you can create a tiny helper function:

In [8]:
# Step 1: Imports
from sqlalchemy import create_engine, text
from prettytable import PrettyTable

# Step 2: Create engine
engine = create_engine("sqlite:///my_data1.db", future=True)

# Step 3: Define helper function
def sql(query, fetch=True):
    """
    Execute a raw SQL query using SQLAlchemy 2.x engine.
    If fetch=True, returns query results as a PrettyTable.
    """
    with engine.connect() as conn:
        result = conn.execute(text(query))
        conn.commit()
        
        # If query is SELECT and fetch=True, return PrettyTable
        if fetch and query.strip().lower().startswith("select"):
            table = PrettyTable()
            # Use column names from result
            table.field_names = result.keys()
            for row in result:
                table.add_row(list(row))
            return table
        return None

```python
# -------------------------------
# Step 4: Examples of usage
# -------------------------------

# Drop table if exists
sql("DROP TABLE IF EXISTS SPACEXTABLE", fetch=False)

# Create table
sql("""
CREATE TABLE SPACEXTABLE (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    launch_date TEXT
)
""", fetch=False)

# Insert data
sql("INSERT INTO SPACEXTABLE (name, launch_date) VALUES ('Falcon 1', '2006-03-24')", fetch=False)
sql("INSERT INTO SPACEXTABLE (name, launch_date) VALUES ('Falcon 9', '2010-06-04')", fetch=False)

# Select data
print(sql("SELECT * FROM SPACEXTABLE"))

In [9]:
sql("DROP TABLE IF EXISTS SPACEXTABLE;")

In [10]:
sql("create table SPACEXTABLE as select * from SPACEXTBL where Date is not null")

In [ ]:
sql("SELECT name FROM sqlite_master WHERE type='table'")

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [12]:
# Task 1: Display unique launch sites
print(sql('SELECT DISTINCT "Launch_Site" FROM SPACEXTABLE'))

+--------------+
| Launch_Site  |
+--------------+
| CCAFS LC-40  |
| VAFB SLC-4E  |
|  KSC LC-39A  |
| CCAFS SLC-40 |
+--------------+


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [13]:
sql('Select * from SPACEXTABLE WHERE "Launch_Site" like \'CCA%\' LIMIT 5')

+------------+------------+-----------------+-------------+---------------------------------------------------------------+-------------------+-----------+-----------------+-----------------+---------------------+
|    Date    | Time (UTC) | Booster_Version | Launch_Site |                            Payload                            | PAYLOAD_MASS__KG_ |   Orbit   |     Customer    | Mission_Outcome |   Landing_Outcome   |
+------------+------------+-----------------+-------------+---------------------------------------------------------------+-------------------+-----------+-----------------+-----------------+---------------------+
| 2010-06-04 |  18:45:00  |  F9 v1.0  B0003 | CCAFS LC-40 |              Dragon Spacecraft Qualification Unit             |         0         |    LEO    |      SpaceX     |     Success     | Failure (parachute) |
| 2010-12-08 |  15:43:00  |  F9 v1.0  B0004 | CCAFS LC-40 | Dragon demo flight C1, two CubeSats, barrel of Brouere cheese |         0         | LEO (ISS) | NASA (COTS) NRO |     Success     | Failure (parachute) |
| 2012-05-22 |  7:44:00   |  F9 v1.0  B0005 | CCAFS LC-40 |                     Dragon demo flight C2                     |        525        | LEO (ISS) |   NASA (COTS)   |     Success     |      No attempt     |
| 2012-10-08 |  0:35:00   |  F9 v1.0  B0006 | CCAFS LC-40 |                          SpaceX CRS-1                         |        500        | LEO (ISS) |    NASA (CRS)   |     Success     |      No attempt     |
| 2013-03-01 |  15:10:00  |  F9 v1.0  B0007 | CCAFS LC-40 |                          SpaceX CRS-2                         |        677        | LEO (ISS) |    NASA (CRS)   |     Success     |      No attempt     |
+------------+------------+-----------------+-------------+---------------------------------------------------------------+-------------------+-----------+-----------------+-----------------+---------------------+

‚úÖ Notes:

1. Double quotes `"Launch_Site"` ensure the mixed-case column name is recognized.
2. `LIKE 'CCA%'` matches all launch sites starting with `CCA`.
3. `LIMIT 5` returns only the first 5 records.
4. `sql()` helper will display results as a PrettyTable.

---

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [16]:
sql('SELECT SUM("PAYLOAD_MASS__KG_") AS "Total_Payload_Mass" FROM SPACEXTABLE WHERE "Customer"="NASA (CRS)"')

+--------------------+
| Total_Payload_Mass |
+--------------------+
|       45596        |
+--------------------+

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [17]:
sql('SELECT AVG("PAYLOAD_MASS__KG_") AS "AVG_PAYLOAD_BY_F9_V1.1" FROM SPACEXTABLE WHERE "Booster_Version" LIKE \'F9 v1.1%\'')

+------------------------+
| AVG_PAYLOAD_BY_F9_V1.1 |
+------------------------+
|   2534.6666666666665   |
+------------------------+

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [24]:
# df['Landing_Outcome'].value_counts()
sql('SELECT MIN("Date") AS "First_Ground_Pad_Success_On" FROM SPACEXTABLE WHERE "Landing_Outcome" LIKE "Success %ground pad%"')

+-----------------------------+
| First_Ground_Pad_Success_On |
+-----------------------------+
|          2015-12-22         |
+-----------------------------+

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [30]:
# df['Landing_Outcome'].value_counts()
sql('SELECT DISTINCT "Booster_Version" FROM SPACEXTABLE WHERE "PAYLOAD_MASS__KG_" BETWEEN 4000 AND 6000 AND "Landing_Outcome" LIKE \'Success%drone ship%\'')

+-----------------+
| Booster_Version |
+-----------------+
|   F9 FT B1022   |
|   F9 FT B1026   |
|  F9 FT  B1021.2 |
|  F9 FT  B1031.2 |
+-----------------+

### Task 7




##### List the total number of successful and failure mission outcomes

In [41]:
df['Mission_Outcome'].value_counts()
sql("""SELECT
        CASE
          WHEN "Mission_Outcome" LIKE \'Success%\' THEN \'Success\'
          WHEN "Mission_Outcome" LIKE \'Failure%\' THEN \'Failure\'
        END AS "Outcome_Type",
        COUNT(*) AS "Total_Count"
     FROM SPACEXTABLE
     WHERE "Mission_Outcome" LIKE \'Success%\' OR "Mission_Outcome" LIKE \'Failure%\'
     GROUP BY "Outcome_Type" """)

+--------------+-------------+
| Outcome_Type | Total_Count |
+--------------+-------------+
|   Failure    |      1      |
|   Success    |     100     |
+--------------+-------------+

### Task 8



##### List all the booster_versions that have carried the maximum payload mass, using a subquery with a suitable aggregate function.

‚úÖ This query will return all Booster_Version values that carried the heaviest payload(s).

In [45]:
# df.columns
sql("""SELECT DISTINCT "Booster_Version"
     FROM SPACEXTABLE
     WHERE "PAYLOAD_MASS__KG_" = (
         SELECT MAX("PAYLOAD_MASS__KG_")
         FROM SPACEXTABLE
     )""")

+-----------------+
| Booster_Version |
+-----------------+
|  F9 B5 B1048.4  |
|  F9 B5 B1049.4  |
|  F9 B5 B1051.3  |
|  F9 B5 B1056.4  |
|  F9 B5 B1048.5  |
|  F9 B5 B1051.4  |
|  F9 B5 B1049.5  |
|  F9 B5 B1060.2  |
|  F9 B5 B1058.3  |
|  F9 B5 B1051.6  |
|  F9 B5 B1060.3  |
|  F9 B5 B1049.7  |
+-----------------+

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [46]:
sql("""SELECT 
        substr("Date", 6, 2) AS "Month",
        "Landing_Outcome",
        "Booster_Version",
        "Launch_Site"
     FROM SPACEXTABLE
     WHERE substr("Date", 1, 4) = \'2015\'
       AND "Landing_Outcome" LIKE \'Failure%drone ship%\'""")

+-------+----------------------+-----------------+-------------+
| Month |   Landing_Outcome    | Booster_Version | Launch_Site |
+-------+----------------------+-----------------+-------------+
|   01  | Failure (drone ship) |  F9 v1.1 B1012  | CCAFS LC-40 |
|   04  | Failure (drone ship) |  F9 v1.1 B1015  | CCAFS LC-40 |
+-------+----------------------+-----------------+-------------+

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [47]:
sql("""SELECT 
        "Landing_Outcome",
        COUNT(*) AS "Outcome_Count"
     FROM SPACEXTABLE
     WHERE "Date" BETWEEN \'2010-06-04\' AND \'2017-03-20\'
     GROUP BY "Landing_Outcome"
     ORDER BY "Outcome_Count" DESC""")

+------------------------+---------------+
|    Landing_Outcome     | Outcome_Count |
+------------------------+---------------+
|       No attempt       |       10      |
|  Success (drone ship)  |       5       |
|  Failure (drone ship)  |       5       |
|  Success (ground pad)  |       3       |
|   Controlled (ocean)   |       3       |
|  Uncontrolled (ocean)  |       2       |
|  Failure (parachute)   |       2       |
| Precluded (drone ship) |       1       |
+------------------------+---------------+

### Use RANK() Function

In [49]:
sql("""SELECT 
        "Landing_Outcome",
        COUNT(*) AS "Outcome_Count",
        RANK() OVER (ORDER BY COUNT(*) DESC) AS "Rank"
     FROM SPACEXTABLE
     WHERE "Date" BETWEEN \'2010-06-04\' AND \'2017-03-20\'
     GROUP BY "Landing_Outcome"
     ORDER BY "Rank" """)

+------------------------+---------------+------+
|    Landing_Outcome     | Outcome_Count | Rank |
+------------------------+---------------+------+
|       No attempt       |       10      |  1   |
|  Success (drone ship)  |       5       |  2   |
|  Failure (drone ship)  |       5       |  2   |
|  Success (ground pad)  |       3       |  4   |
|   Controlled (ocean)   |       3       |  4   |
|  Uncontrolled (ocean)  |       2       |  6   |
|  Failure (parachute)   |       2       |  6   |
| Precluded (drone ship) |       1       |  8   |
+------------------------+---------------+------+

### Explanation

1. `COUNT(*)` ‚Üí counts how many times each `"Landing_Outcome"` occurs.
2. `RANK() OVER (ORDER BY COUNT(*) DESC)` ‚Üí assigns a rank:

   * Highest count ‚Üí Rank 1
   * Ties get the same rank
3. `GROUP BY "Landing_Outcome"` ‚Üí groups all identical outcomes together.
4. `ORDER BY "Rank"` ‚Üí shows results from rank 1 downwards.

---

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

# Let‚Äôs dive into the **`CASE WHEN ... THEN ... END`** syntax in SQL.

---

## 1. What is `CASE` in SQL?

`CASE` is like an **if-else** statement in SQL.
It lets you create new columns or transform values based on conditions.

General syntax:

```sql
SELECT 
    CASE 
        WHEN condition1 THEN result1
        WHEN condition2 THEN result2
        ...
        ELSE resultN
    END AS new_column_name
FROM table_name;
```

---

## 2. Step-by-step breakdown

* **`CASE`** ‚Üí starts the expression.
* **`WHEN condition`** ‚Üí defines a check.
* **`THEN result`** ‚Üí what value should be returned if the condition is true.
* **`ELSE result`** ‚Üí fallback if no conditions match (optional).
* **`END`** ‚Üí closes the `CASE` block.
* **`AS new_column_name`** ‚Üí gives the derived column a name.

---

## 3. Example 1 ‚Äî Simple mapping

Suppose a table `Students` has column `"Marks"`.
We want to label them as **Pass** or **Fail**:

```sql
SELECT 
    "Student_Name",
    "Marks",
    CASE
        WHEN "Marks" >= 40 THEN 'Pass'
        ELSE 'Fail'
    END AS "Result"
FROM Students;
```

üëâ If Marks ‚â• 40 ‚Üí Result = Pass, otherwise = Fail.

---

## 4. Example 2 ‚Äî Multiple conditions

Categorize employees by salary:

```sql
SELECT 
    "Employee_Name",
    "Salary",
    CASE
        WHEN "Salary" >= 100000 THEN 'High'
        WHEN "Salary" >= 50000 THEN 'Medium'
        ELSE 'Low'
    END AS "Salary_Category"
FROM Employees;
```

üëâ Salary ‚â• 100000 ‚Üí High,
Salary ‚â• 50000 but < 100000 ‚Üí Medium,
Else ‚Üí Low.

---

## 5. Example 3 ‚Äî Used with Aggregation

Count missions grouped into Success and Failure:

```sql
SELECT 
    CASE 
        WHEN "Mission_Outcome" LIKE 'Success%' THEN 'Success'
        WHEN "Mission_Outcome" LIKE 'Failure%' THEN 'Failure'
        ELSE 'Other'
    END AS "Outcome_Type",
    COUNT(*) AS "Total_Count"
FROM SPACEXTABLE
GROUP BY "Outcome_Type";
```

üëâ Here `CASE` creates categories, and `COUNT(*)` tallies rows per category.

---

‚úÖ So, `CASE` in SQL is like writing nested **if / else if / else** logic inside your query.